Just tracking the time spent on various features and stuff..

* Grand Total

#+BEGIN: clocktable :maxlevel 3 :scope file
Clock summary at [2016-05-26 Thu 17:12]

| Headline            | Time     |       |       |
|---------------------+----------+-------+-------|
| *Total time*        | *164:21* |       |       |
|---------------------+----------+-------+-------|
| Grand Total         | 164:21   |       |       |
| \__ ASynK Online    |          |  2:50 |       |
| \_____ May 2016     |          |       |  1:04 |
| \_____ Feb 2015     |          |       |  1:46 |
| \__ MSExchange      |          | 77:05 |       |
| \_____ May 2014     |          |       | 10:00 |
| \_____ Apr 2014     |          |       | 34:05 |
| \_____ Mar 2014     |          |       | 33:00 |
| \__ pyews library   |          | 44:37 |       |
| \_____ Apr 2014     |          |       | 28:42 |
| \_____ Mar 2014     |          |       | 15:55 |
| \__ CardDAV Support |          | 39:49 |       |
| \_____ May 2013     |          |       |  2:04 |
| \_____ Apr 2013     |          |       | 37:45 |
#+END:

** ASynK Online

*** May 2016
    CLOCK: [2016-05-26 Thu 16:08]--[2016-05-26 Thu 17:12] =>  1:04

*** Feb 2015
   CLOCK: [2015-02-10 Tue 18:06]--[2015-02-10 Tue 19:52] =>  1:46


** MSExchange
*** May 2014
   CLOCK: [2014-05-03 Sat 22:03]--[2014-05-04 Sun 00:12] =>  2:09
   CLOCK: [2014-05-03 Sat 16:36]--[2014-05-03 Sat 18:33] =>  1:57
   CLOCK: [2014-05-03 Sat 13:29]--[2014-05-03 Sat 16:29] =>  3:00
   CLOCK: [2014-05-03 Sat 00:34]--[2014-05-03 Sat 01:53] =>  1:19
   CLOCK: [2014-05-01 Thu 12:18]--[2014-05-01 Thu 12:27] =>  0:09
   CLOCK: [2014-05-01 Thu 09:35]--[2014-05-01 Thu 10:47] =>  1:12
   CLOCK: [2014-05-01 Thu 09:06]--[2014-05-01 Thu 09:20] =>  0:14

*** Apr 2014
   CLOCK: [2014-04-29 Tue 23:01]--[2014-04-30 Wed 00:28] =>  1:27
   CLOCK: [2014-04-29 Tue 22:00]--[2014-04-29 Tue 22:42] =>  0:42
   CLOCK: [2014-04-29 Tue 12:41]--[2014-04-29 Tue 13:35] =>  0:54
   CLOCK: [2014-04-28 Mon 07:37]--[2014-04-28 Mon 08:31] =>  0:54
   CLOCK: [2014-04-28 Mon 05:30]--[2014-04-28 Mon 07:37] =>  2:07
   CLOCK: [2014-04-27 Sun 12:43]--[2014-04-27 Sun 13:43] =>  1:00
   CLOCK: [2014-04-27 Sun 12:05]--[2014-04-27 Sun 12:28] =>  0:23
   CLOCK: [2014-04-27 Sun 10:19]--[2014-04-27 Sun 11:25] =>  1:06
   CLOCK: [2014-04-26 Sat 18:57]--[2014-04-26 Sat 19:24] =>  0:27
   CLOCK: [2014-04-25 Fri 10:55]--[2014-04-25 Fri 12:33] =>  1:38
   CLOCK: [2014-04-25 Fri 09:00]--[2014-04-25 Fri 09:03] =>  0:03
   CLOCK: [2014-04-24 Thu 21:24]--[2014-04-25 Fri 00:01] =>  2:37
   CLOCK: [2014-04-24 Thu 18:48]--[2014-04-24 Thu 19:07] =>  0:19
   CLOCK: [2014-04-24 Thu 17:50]--[2014-04-24 Thu 18:45] =>  0:55
   CLOCK: [2014-04-24 Thu 12:44]--[2014-04-24 Thu 13:38] =>  0:54
   CLOCK: [2014-04-21 Mon 06:41]--[2014-04-21 Mon 09:01] =>  2:20
   CLOCK: [2014-04-20 Sun 11:01]--[2014-04-20 Sun 12:42] =>  1:41
   CLOCK: [2014-04-19 Sat 23:49]--[2014-04-20 Sun 01:09] =>  1:20
   CLOCK: [2014-04-18 Fri 16:59]--[2014-04-18 Fri 18:55] =>  1:56
   CLOCK: [2014-04-07 Mon 06:34]--[2014-04-07 Mon 07:10] =>  0:36
   CLOCK: [2014-04-06 Sun 16:03]--[2014-04-06 Sun 18:04] =>  2:01
   CLOCK: [2014-04-05 Sat 18:17]--[2014-04-05 Sat 21:36] =>  3:19
   CLOCK: [2014-04-02 Wed 18:15]--[2014-04-02 Wed 22:56] =>  4:41
   CLOCK: [2014-04-01 Tue 15:06]--[2014-04-01 Tue 15:17] =>  0:11
   CLOCK: [2014-04-01 Tue 14:48]--[2014-04-01 Tue 14:50] =>  0:02
   CLOCK: [2014-04-01 Tue 08:47]--[2014-04-01 Tue 09:19] =>  0:32

*** Mar 2014
   CLOCK: [2014-03-31 Mon 15:40]--[2014-03-31 Mon 15:44] =>  0:04
   CLOCK: [2014-03-31 Mon 16:33]--[2014-03-31 Mon 17:03] =>  0:30
   CLOCK: [2014-03-31 Mon 16:00]--[2014-03-31 Mon 16:30] =>  0:30
   CLOCK: [2014-03-31 Mon 15:45]--[2014-03-31 Mon 15:55] =>  0:10
   CLOCK: [2014-03-31 Mon 15:40]--[2014-03-31 Mon 15:44] =>  0:04
   CLOCK: [2014-03-30 Sun 17:22]--[2014-03-30 Sun 18:35] =>  1:13
   CLOCK: [2014-03-30 Sun 16:56]--[2014-03-30 Sun 17:16] =>  0:20
   CLOCK: [2014-03-30 Sun 14:16]--[2014-03-30 Sun 14:23] =>  0:07
   CLOCK: [2014-03-30 Sun 13:30]--[2014-03-30 Sun 13:36] =>  0:06
   CLOCK: [2014-03-30 Sun 12:27]--[2014-03-30 Sun 12:29] =>  0:02
   CLOCK: [2014-03-30 Sun 07:44]--[2014-03-30 Sun 10:22] =>  2:38
   CLOCK: [2014-03-30 Sun 17:22]--[2014-03-30 Sun 18:35] =>  1:13
   CLOCK: [2014-03-30 Sun 16:56]--[2014-03-30 Sun 17:16] =>  0:20
   CLOCK: [2014-03-30 Sun 14:16]--[2014-03-30 Sun 14:23] =>  0:07
   CLOCK: [2014-03-30 Sun 13:30]--[2014-03-30 Sun 13:36] =>  0:06
   CLOCK: [2014-03-30 Sun 12:27]--[2014-03-30 Sun 12:29] =>  0:02
   CLOCK: [2014-03-30 Sun 07:44]--[2014-03-30 Sun 10:22] =>  2:38
   CLOCK: [2014-03-27 Thu 17:51]--[2014-03-27 Thu 18:01] =>  0:10
   CLOCK: [2014-03-27 Thu 17:45]--[2014-03-27 Thu 17:47] =>  0:02
   CLOCK: [2014-03-27 Thu 17:51]--[2014-03-27 Thu 18:01] =>  0:10
   CLOCK: [2014-03-27 Thu 17:45]--[2014-03-27 Thu 17:47] =>  0:02
   CLOCK: [2014-03-16 Sun 10:01]--[2014-03-16 Sun 15:53] =>  5:52
   CLOCK: [2014-03-16 Sun 09:32]--[2014-03-16 Sun 10:01] =>  0:29
   CLOCK: [2014-03-16 Sun 10:01]--[2014-03-16 Sun 15:53] =>  5:52
   CLOCK: [2014-03-16 Sun 09:32]--[2014-03-16 Sun 10:01] =>  0:29
   CLOCK: [2014-03-15 Sat 16:18]--[2014-03-15 Sat 17:16] =>  0:58
   CLOCK: [2014-03-15 Sat 15:24]--[2014-03-15 Sat 15:26] =>  0:02
   CLOCK: [2014-03-15 Sat 16:18]--[2014-03-15 Sat 17:16] =>  0:58
   CLOCK: [2014-03-15 Sat 15:24]--[2014-03-15 Sat 15:26] =>  0:02
   CLOCK: [2014-03-05 Wed 19:19]--[2014-03-05 Wed 19:39] =>  0:20
   CLOCK: [2014-03-05 Wed 17:01]--[2014-03-05 Wed 17:43] =>  0:42
   CLOCK: [2014-03-05 Wed 16:31]--[2014-03-05 Wed 16:51] =>  0:20
   CLOCK: [2014-03-05 Wed 16:10]--[2014-03-05 Wed 16:30] =>  0:20
   CLOCK: [2014-03-05 Wed 15:05]--[2014-03-05 Wed 16:00] =>  0:55
   CLOCK: [2014-03-05 Wed 14:03]--[2014-03-05 Wed 14:23] =>  0:20
   CLOCK: [2014-03-05 Wed 12:35]--[2014-03-05 Wed 13:03] =>  0:28
   CLOCK: [2014-03-05 Wed 11:41]--[2014-03-05 Wed 12:01] =>  0:20
   CLOCK: [2014-03-05 Wed 11:23]--[2014-03-05 Wed 11:30] =>  0:07
   CLOCK: [2014-03-05 Wed 19:19]--[2014-03-05 Wed 19:39] =>  0:20
   CLOCK: [2014-03-05 Wed 17:01]--[2014-03-05 Wed 17:43] =>  0:42
   CLOCK: [2014-03-05 Wed 16:31]--[2014-03-05 Wed 16:51] =>  0:20
   CLOCK: [2014-03-05 Wed 16:10]--[2014-03-05 Wed 16:30] =>  0:20
   CLOCK: [2014-03-05 Wed 15:05]--[2014-03-05 Wed 16:00] =>  0:55
   CLOCK: [2014-03-05 Wed 14:03]--[2014-03-05 Wed 14:23] =>  0:20
   CLOCK: [2014-03-05 Wed 12:35]--[2014-03-05 Wed 13:03] =>  0:28
   CLOCK: [2014-03-05 Wed 11:41]--[2014-03-05 Wed 12:01] =>  0:20
   CLOCK: [2014-03-05 Wed 11:23]--[2014-03-05 Wed 11:30] =>  0:07




** pyews library
*** Apr 2014
   CLOCK: [2014-05-03 Sat 22:03]--[2014-05-04 Sun 00:12] =>  2:09
   CLOCK: [2014-05-03 Sat 16:36]--[2014-05-03 Sat 18:33] =>  1:57
   CLOCK: [2014-05-03 Sat 13:29]--[2014-05-03 Sat 16:29] =>  3:00
   CLOCK: [2014-05-03 Sat 00:34]--[2014-05-03 Sat 01:53] =>  1:19
   CLOCK: [2014-05-01 Thu 12:18]--[2014-05-01 Thu 12:27] =>  0:09
   CLOCK: [2014-05-01 Thu 09:35]--[2014-05-01 Thu 10:47] =>  1:12
   CLOCK: [2014-05-01 Thu 09:06]--[2014-05-01 Thu 09:20] =>  0:14
   CLOCK: [2014-04-29 Tue 23:01]--[2014-04-30 Wed 00:28] =>  1:27
   CLOCK: [2014-04-29 Tue 22:00]--[2014-04-29 Tue 22:42] =>  0:42
   CLOCK: [2014-04-29 Tue 12:41]--[2014-04-29 Tue 13:35] =>  0:54
   CLOCK: [2014-04-28 Mon 07:37]--[2014-04-28 Mon 08:31] =>  0:54
   CLOCK: [2014-04-28 Mon 05:30]--[2014-04-28 Mon 07:37] =>  2:07
   CLOCK: [2014-04-27 Sun 12:43]--[2014-04-27 Sun 13:43] =>  1:00
   CLOCK: [2014-04-27 Sun 12:05]--[2014-04-27 Sun 12:28] =>  0:23
   CLOCK: [2014-04-27 Sun 10:19]--[2014-04-27 Sun 11:25] =>  1:06
   CLOCK: [2014-04-26 Sat 18:57]--[2014-04-26 Sat 19:24] =>  0:27
   CLOCK: [2014-04-25 Fri 10:55]--[2014-04-25 Fri 12:33] =>  1:38
   CLOCK: [2014-04-25 Fri 09:00]--[2014-04-25 Fri 09:03] =>  0:03
   CLOCK: [2014-04-24 Thu 21:24]--[2014-04-25 Fri 00:01] =>  2:37
   CLOCK: [2014-04-24 Thu 18:48]--[2014-04-24 Thu 19:07] =>  0:19
   CLOCK: [2014-04-24 Thu 17:50]--[2014-04-24 Thu 18:45] =>  0:55
   CLOCK: [2014-04-24 Thu 12:44]--[2014-04-24 Thu 13:38] =>  0:54
   CLOCK: [2014-04-19 Sat 23:49]--[2014-04-20 Sun 01:09] =>  1:20
   CLOCK: [2014-04-18 Fri 16:59]--[2014-04-18 Fri 18:55] =>  1:56

*** Mar 2014
   CLOCK: [2014-03-31 Mon 15:40]--[2014-03-31 Mon 15:44] =>  0:04
   CLOCK: [2014-03-30 Sun 17:22]--[2014-03-30 Sun 18:35] =>  1:13
   CLOCK: [2014-03-30 Sun 16:56]--[2014-03-30 Sun 17:16] =>  0:20
   CLOCK: [2014-03-30 Sun 14:16]--[2014-03-30 Sun 14:23] =>  0:07
   CLOCK: [2014-03-30 Sun 13:30]--[2014-03-30 Sun 13:36] =>  0:06
   CLOCK: [2014-03-30 Sun 12:27]--[2014-03-30 Sun 12:29] =>  0:02
   CLOCK: [2014-03-30 Sun 07:44]--[2014-03-30 Sun 10:22] =>  2:38
   CLOCK: [2014-03-27 Thu 17:51]--[2014-03-27 Thu 18:01] =>  0:10
   CLOCK: [2014-03-27 Thu 17:45]--[2014-03-27 Thu 17:47] =>  0:02
   CLOCK: [2014-03-16 Sun 10:01]--[2014-03-16 Sun 15:53] =>  5:52
   CLOCK: [2014-03-16 Sun 09:32]--[2014-03-16 Sun 10:01] =>  0:29
   CLOCK: [2014-03-15 Sat 16:18]--[2014-03-15 Sat 17:16] =>  0:58
   CLOCK: [2014-03-15 Sat 15:24]--[2014-03-15 Sat 15:26] =>  0:02
   CLOCK: [2014-03-05 Wed 19:19]--[2014-03-05 Wed 19:39] =>  0:20
   CLOCK: [2014-03-05 Wed 17:01]--[2014-03-05 Wed 17:43] =>  0:42
   CLOCK: [2014-03-05 Wed 16:31]--[2014-03-05 Wed 16:51] =>  0:20
   CLOCK: [2014-03-05 Wed 16:10]--[2014-03-05 Wed 16:30] =>  0:20
   CLOCK: [2014-03-05 Wed 15:05]--[2014-03-05 Wed 16:00] =>  0:55
   CLOCK: [2014-03-05 Wed 14:03]--[2014-03-05 Wed 14:23] =>  0:20
   CLOCK: [2014-03-05 Wed 12:35]--[2014-03-05 Wed 13:03] =>  0:28
   CLOCK: [2014-03-05 Wed 11:41]--[2014-03-05 Wed 12:01] =>  0:20
   CLOCK: [2014-03-05 Wed 11:23]--[2014-03-05 Wed 11:30] =>  0:07



** Regression Tests
*** Aug 2013
**** Aug 10, 2013
** Handling Parsing Errors
** CardDAV Support
*** May 2013
**** May 15, 2013
    CLOCK: [2013-05-15 Wed 05:59]--[2013-05-15 Wed 07:14] =>  1:15

**** May 14, 2013
    CLOCK: [2013-05-14 Tue 17:16]--[2013-05-14 Tue 18:05] =>  0:49

*** Apr 2013
**** April 21, 2013
    CLOCK: [2013-04-21 Sun 20:57]--[2013-04-21 Sun 21:18] =>  0:21
    CLOCK: [2013-04-21 Sun 06:30]--[2013-04-21 Sun 07:18] =>  0:48

**** April 20, 2013
    CLOCK: [2013-04-20 Sat 06:03]--[2013-04-20 Sat 06:25] =>  0:22

**** April 19, 2013
    CLOCK: [2013-04-19 Fri 17:15]--[2013-04-19 Fri 18:43] =>  1:28
    CLOCK: [2013-04-19 Fri 14:34]--[2013-04-19 Fri 15:44] =>  1:10
    CLOCK: [2013-04-19 Fri 11:04]--[2013-04-19 Fri 11:22] =>  0:18

**** April 18, 2013
    CLOCK: [2013-04-18 Thu 16:36]--[2013-04-18 Thu 18:16] =>  1:40

**** April 16, 2013
    CLOCK: [2013-04-16 Tue 15:04]--[2013-04-16 Tue 18:40] =>  3:36
    CLOCK: [2013-04-16 Tue 11:19]--[2013-04-16 Tue 11:38] =>  0:19
    CLOCK: [2013-04-16 Tue 09:27]--[2013-04-16 Tue 09:38] =>  0:11
    CLOCK: [2013-04-16 Tue 06:38]--[2013-04-16 Tue 07:47] =>  1:09

**** April 15, 2013
    CLOCK: [2013-04-15 Mon 16:00]--[2013-04-15 Mon 18:23] =>  2:23
    CLOCK: [2013-04-15 Mon 06:55]--[2013-04-15 Mon 07:41] =>  0:46

**** April 13, 2013
    CLOCK: [2013-04-13 Sat 10:51]--[2013-04-13 Sat 11:51] =>  1:00

**** April 10, 2013
    CLOCK: [2013-04-10 Wed 14:04]--[2013-04-10 Wed 15:17] =>  1:13

**** April 09, 2013
    CLOCK: [2013-04-09 Tue 17:09]--[2013-04-09 Tue 17:38] =>  0:29

**** April 08, 2013
    CLOCK: [2013-04-08 Mon 11:25]--[2013-04-08 Mon 11:59] =>  0:34
    CLOCK: [2013-04-08 Mon 09:55]--[2013-04-08 Mon 11:13] =>  1:18

**** April 07, 2013
    CLOCK: [2013-04-07 Sun 07:39]--[2013-04-07 Sun 07:48] =>  0:09

**** April 06, 2013
    CLOCK: [2013-04-06 Sat 21:34]--[2013-04-06 Sat 22:38] =>  1:04
    CLOCK: [2013-04-06 Sat 19:06]--[2013-04-06 Sat 19:27] =>  0:21
    CLOCK: [2013-04-06 Sat 18:10]--[2013-04-06 Sat 18:17] =>  0:07

**** April 05, 2013
    CLOCK: [2013-04-06 Sat 06:08]--[2013-04-06 Sat 06:29] =>  0:21
    CLOCK: [2013-04-05 Fri 21:35]--[2013-04-05 Fri 21:36] =>  0:01
    CLOCK: [2013-04-05 Fri 13:21]--[2013-04-05 Fri 15:50] =>  2:29
    CLOCK: [2013-04-05 Fri 12:45]--[2013-04-05 Fri 13:18] =>  0:33
    CLOCK: [2013-04-05 Fri 10:09]--[2013-04-05 Fri 10:15] =>  0:06
    CLOCK: [2013-04-05 Fri 06:48]--[2013-04-05 Fri 06:58] =>  0:10

**** April 04, 2013
    CLOCK: [2013-04-04 Thu 22:03]--[2013-04-04 Thu 22:35] =>  0:32
    CLOCK: [2013-04-04 Thu 18:21]--[2013-04-04 Thu 19:20] =>  0:59
    CLOCK: [2013-04-04 Thu 16:32]--[2013-04-04 Thu 17:01] =>  0:29
    CLOCK: [2013-04-04 Thu 14:10]--[2013-04-04 Thu 15:43] =>  1:33
    CLOCK: [2013-04-04 Thu 13:20]--[2013-04-04 Thu 13:25] =>  0:05
    CLOCK: [2013-04-04 Thu 11:28]--[2013-04-04 Thu 12:47] =>  1:19
    CLOCK: [2013-04-04 Thu 07:30]--[2013-04-04 Thu 08:24] =>  0:54

**** April 03, 2013
    CLOCK: [2013-04-03 Wed 18:51]--[2013-04-03 Wed 20:22] =>  1:31
    CLOCK: [2013-04-03 Wed 16:27]--[2013-04-03 Wed 17:36] =>  1:09
    CLOCK: [2013-04-03 Wed 05:29]--[2013-04-03 Wed 06:52] =>  1:23

**** April 02, 2013
    CLOCK: [2013-04-02 Tue 18:41]--[2013-04-02 Tue 19:42] =>  1:01
    CLOCK: [2013-04-02 Tue 17:47]--[2013-04-02 Tue 18:26] =>  0:39
    CLOCK: [2013-04-02 Tue 14:26]--[2013-04-02 Tue 15:21] =>  0:55
    CLOCK: [2013-04-02 Tue 12:58]--[2013-04-02 Tue 13:48] =>  0:50
